package com.example.whankung.socialherb.fragment.Article;

import android.graphics.Typeface;
import android.os.Bundle;
import android.support.annotation.Nullable;
import android.support.v4.app.Fragment;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.ImageView;
import android.widget.RatingBar;
import android.widget.TextView;

import com.example.whankung.socialherb.R;

import static com.example.whankung.socialherb.R.id.t;

/**
 * Created by Whankung on 1/2/2560.
 */
public class DataArticle2 extends Fragment {

    private View rootView;
    private Typeface font;
    private ImageView i;
    private TextView t, t2, t3, t4, t5, t6,nm, un, date;
    private String link = "http://www.thaihealth.or.th/Content/35077-%E2%80%98%E0%B9%82%E0%B8%A3%E0%B8%84%E0%B8%AD%E0%B9%89%E0%B8%A7%E0%B8%99%E2%80%99%20%E0%B8%A1%E0%B8%AB%E0%B8%B1%E0%B8%99%E0%B8%95%E0%B8%A0%E0%B8%B1%E0%B8%A2%E0%B8%A1%E0%B8%B7%E0%B8%94%E0%B8%A1%E0%B8%99%E0%B8%B8%E0%B8%A9%E0%B8%A2%E0%B9%8C%E0%B9%80%E0%B8%A1%E0%B8%B7%E0%B8%AD%E0%B8%87.html";
    private RatingBar rat;
    @Nullable
    @Override
    public View onCreateView(LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceStat) {
        rootView = inflater.inflate(R.layout.data_article2, container, false);
        setView();
        setData();

        return rootView;
    }

    private void setView() {

        t = (TextView) rootView.findViewById(R.id.nameA);
        t2 = (TextView) rootView.findViewById(R.id.nameDdataA);
        t3 = (TextView) rootView.findViewById(R.id.namef);
        t4 = (TextView) rootView.findViewById(R.id.namefda);
        t5 = (TextView) rootView.findViewById(R.id.namefdat);

        i = (ImageView) rootView.findViewById(R.id.imageView2_b);

        font = Typeface.createFromAsset(getContext().getAssets(), "tmedium.ttf");

        t.setTypeface(font);
        t2.setTypeface(font);
        t3.setTypeface(font);
        t4.setTypeface(font);
        t5.setTypeface(font);


    }

    private void setData() {
        i.setImageResource(R.drawable.img_a2);
        t2.setText("ส้มซ่า และ ส้มสา");
        t3.setText("ส้ม ถือเป็นไม้มงคลที่คนไทยเชื้อสายจีนเขานิยมกัน ข้ามปีใหม่อีกไม่กี่วันก็ตรุษจีน-ปีใหม่ของชาวจีน จึงขอแนะนำหรือไขข้อข้องใจ ส้มซ่า และ ส้มสา สมุนไพร 2 ชนิดที่คนมักสับสน\n" +
                "โดยเฉพาะคนรุ่นใหม่ ที่คิดว่า \"ส้มซ่า\" และ \"ส้มสา\" คือพืชชนิดเดียวกัน\n" +
                "ในทางวิชาการ ส้มทั้งสองชนิดเป็นพืชที่อยู่คนละวงศ์ ส้มซ่า มีชื่อวิทยาศาสตร์ว่า Citrus auruntium  L.var.aurantium หรือในปัจจุบันใช้ชื่อวิทยาศาสตร์ว่า Citrus  aurantium L. (เครื่องหมาย x แสดงให้เห็นว่าพืชชนิดนี้มีการคัดสายพันธุ์ขึ้นมาแล้วนำมาปลูก) ส้มซ่าอยู่ในกลุ่มเดียวกับส้มเกลี้ยง เป็นกลุ่มที่มีการคัดสายพันธุ์เพื่อนำมาปลูกเป็นพืชเศรษฐกิจ สำหรับ ส้มสา มีชื่อวิทยาศาสตร์ว่า Myrica esculenta Buch.-Ham ex D.Don อยู่ในวงศ์เอี้ยบ๊วย (Myricaceae)\n" +
                "ส้มซ่า มีชื่อสามัญทางราชการว่า \"ส้มเกลี้ยง\" มีชื่อสามัญในภาษาอังกฤษว่า Bouquetier, Sour orange, Bitter orange, Seville orange, Bigarade มีรายงานว่าส้มซ่าอาจมีแหล่งกำเนิดมาจากทางตะวันออกเฉียงเหนือของอินเดียและพื้นที่ที่ติดกับพม่าและจีน แล้วแพร่กระจายไปทางตะวันออกเฉียงเหนือยัง ญี่ปุ่น และทางตะวันตกผ่านอินเดียไปยังตะวัน ออกกลาง แล้วต่อไปยังยุโรป มีการกระจายอย่างรวดเร็วในเขตเมดิเตอร์ เรเนียนหลายพันปีมาแล้ว จึงว่าพบปลูกอย่างแพร่หลายในสเปน เรียก Seville orange ปัจจุบันมีการปลูกทั่วไปทั้งในเขตร้อน และกึ่งร้อน แต่พบน้อยในเขตเอเชียตะวันออกเฉียงใต้\n" +
                "ส้มซ่าชอบขึ้นในที่มีภูมิอากาศอบอุ่น แต่ทนต่ออากาศร้อนได้ถ้าดินมีความชื้นพอ ไม่ทนต่อสภาพอากาศเย็น เกิดโรคได้ง่าย ถ้าสภาพภูมิอากาศเหมาะสมสามารถปลูกได้ในดินเกือบทุกชนิด ส้มซ่าเป็นไม้ยืนต้นขนาดกลาง สูง 3-10 เมตร ทรงพุ่มกลม มีกิ่งก้านมาก มีหนามยาวตามลำต้น ใบมีจุดต่อมน้ำมันมาก ใบหนาเป็นมัน โคนใบสอบหรือมน ปลายมนถึงปลายทู่ มีต่อมน้ำมันอยู่ทั่วไป มีกลิ่นหอมเมื่อขยี้ ก้านใบมีปีก ดอกสีขาว เป็นดอกเดี่ยวหรือเป็นกลุ่มดอกออกที่ซอกใบ กลีบดอกสีขาว มีกลิ่นหอม ผลกลม ขนาดใกล้เคียงกับผลมะนาว เปลือกหนา เปลือกนอกเป็นสีเขียวอมน้ำตาล เปลือกตุ่มขรุขระ เนื้อในเป็นกรด มีรสขม เล็กน้อย เมล็ดมีจำนวนมาก เนื้อในคล้ายส้มโอ รสเปรี้ยวอมหวาน\n" +
                "ส้มซ่ามีการใช้ประโยชน์โดยใช้ผิวแต่งกลิ่นทะเลอาหาร เช่น หมี่กรอบ ปลาแนม น้ำคั้นจากผล ใช้ปรุงรสเปรี้ยวในอาหาร ใช้เป็นยาแก้ไอ กัดเสมหะ ใช้เป็นน้ำกระสายยา ในตำรายาจีนเรียก จื๋อเบอ (ภาษาจีนกลาง) หรือจี๋ปัก (ภาษาจีนแต้จิ๋ว) ใช้เป็นยาเจริญอาหาร เปลือกผล รสปร่าหอมใช้ทำยาหอมแก้ลมวิงเวียนหน้ามืดตาลาย แก้ท้องอืดท้องเฟ้อ น้ำในลูก รสเปรี้ยวอมหวาน กัดฟอก เสมหะ แก้ไอ ฟอกโลหิต ใบ รักษาโรคผิวหนัง\n" +
                "สำหรับ ส้มสา ชื่อวิทยาศาสตร์ : Myrica esculenta Buch.-Ham ex D.Don สมุนไพรชนิดนี้ในประเทศไทยพบอยู่ในพื้นที่เป็นภูเขาเท่านั้น จากชื่อท้องถิ่นดูเหมือนว่ามีการกระจายอยู่ในหลายพื้นที่ เช่น ตุด เม็ดชุนตัวผู้ (พังงา) ถั่ว ฤาษีเสก หว้าโละ (ชัยนาท) ส้มสา ส้มส้าอินสัมปัดถา (เลย) เส่ข่อโผ่ (กะเหรี่ยงแม่ฮ่องสอน) หม่อนอ่อน (เงี้ยว เชียงใหม่) เอี๊ยบ๊อย (จีน)\n" +
                "ส้มสามีชื่อสามัญในภาษาอังกฤษว่า Bayberry, Box myrtle มีรายงานว่าเป็นพืชพื้นเมืองในแถบหุบเขาของเนปาล และพื้นที่สูงของอินเดียโดยเฉพาะรัฐปัญจาบ พบในเอเชียใต้ ตะวันตกเฉียงเหนือของกว่างตงและกวางสี ทางตอนใต้และตะวันตกของกุยโจวและทางตอนใต้ของเสฉวนและยูนนาน ของประเทศจีน คาบสมุทรอินโดจีน คาบสมุทรมลายู อินโดนีเซีย ฟิลิปปินส์ นอกจากนี้ ยังมีรายงานว่าพบในภูฏาน อินเดีย เมียนมา ไทย และเวียดนาม\n" +
                "ส้มสาเจริญเติบโตได้ดีในป่าเบญจพรรณ ที่อยู่บนภูเขาที่สูง 300-2,500 เมตรจากระดับน้ำทะเล เป็นไม้ยืนต้นขนาดกลาง สูง 4-10 เมตร เป็นพืชที่ไม่ผลัดใบ มีการแตกกิ่งจำนวนมากหรือลำต้นสั้นและคดงอ เปลือกลำต้นอ่อน สีเทาหรือสีน้ำตาล เปลือกต้นมีรอยแตกตามยาว เปลือกชั้นในสีแดงอมส้ม มีรสขม แผ่นใบเป็นรูปรี แคบ หรือเป็นรูปหอก ใบอ่อนมีขนสีออกชมพู ใบแก่เหนียว สีเขียวเป็นมัน มีจุดน้ำยางเหนียวกระจายทั่วผิว ดอกขนาดเล็กมาก เป็นช่อแน่น ไม่มีกลีบเลี้ยงและกลีบดอก ดอกตัวผู้สีแดง ดอกตัวเมียสีเขียว\n" +
                "ข้อมูลจากการแพทย์อายุรเวท ยังจำแนกว่าส้มสามี 2 ชนิด คือ ชนิดที่มีดอกสีขาวและดอกสีแดง ผลมีเนื้อนุ่ม ผิวมีตุ่มเล็กๆ ขรุขระเมื่อสุกมีสีแดง ผลรสหวานอมเปรี้ยวรับประทานได้หรือใช้ทำน้ำผลไม้ได้เช่นกัน ในจีนใช้เปลือกไม้เป็นแหล่งของแทนนินในการฟอกหนัง น้ำต้มเปลือกแก้ท้องเสีย หลอดลมอักเสบและลำไส้อักเสบ เปลือกใช้เป็นยาสมาน ป้องกันแผลเน่า รักษาโรคบิด รูมาติก ท้องร่วง ใช้เบื่อปลา ทำฟืน ไขที่หุ้มผลแยกออกได้โดยการต้ม ใช้ทำเทียนและสบู่ ในเปลือกมีสารสีเหลืองจำพวก myrisetin, myricitrin และ glycoside ใช้ทำสีย้อมผ้าโดยย้อมผ้าฝ้ายได้สีเหลืองอมน้ำตาล\n" +
                "อย่างไรก็ตาม ทั้ง ส้มซ่าและส้มสา เป็นพืชที่ควรแก่การศึกษาและพัฒนานำมาใช้ประโยชน์ในสังคมให้กว้างขวางต่อไป");
        t5.setText("มติชนสุดสัปดาห์");


    }


}
